projects/case-c8eccb64/working/night_optimization/foam_candidates/candidate-926a140f/working/openfoam_case/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
scale 1.0;
vertices
(
    (-12 -6 -6)
    ( 24 -6 -6)
    ( 24  6 -6)
    (-12  6 -6)
    (-12 -6  6)
    ( 24 -6  6)
    ( 24  6  6)
    (-12  6  6)
);
blocks
(
    hex (0 1 2 3 4 5 6 7) (40 20 20) simpleGrading (1 1 1)
);
boundary
(
    inlet
    {
        type patch;
        faces ((0 4 7 3));
    }
    outlet
    {
        type patch;
        faces ((1 2 6 5));
    }
    farField
    {
        type patch;
        faces
        (
            (0 1 5 4)
            (2 3 7 6)
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);
